feat: mkdocs with shadcn
